create_clock -name MY_CLK -period 13.28 clk
ungroup -all -flatten
change_names -hierarchy -rules verilog
write_sdf ../netlist/riscv_abs.sdf
write -f verilog -hierarchy -output ../netlist/riscv_abs.v
write_sdc ../netlist/riscv_abs.sdc
