###################################################################

# Created by write_sdc on Tue Feb  9 02:33:52 2021

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {data_mem_out[31]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[30]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[29]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[28]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[27]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[26]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[25]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[24]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[23]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[22]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[21]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[20]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[19]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[18]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[17]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[16]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[15]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[14]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[13]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[12]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[11]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[10]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[9]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[8]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[7]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[6]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[5]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[4]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[3]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[2]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[1]}]
set_load -pin_load 3.40189 [get_ports {data_mem_out[0]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[31]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[30]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[29]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[28]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[27]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[26]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[25]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[24]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[23]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[22]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[21]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[20]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[19]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[18]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[17]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[16]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[15]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[14]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[13]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[12]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[11]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[10]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[9]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[8]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[7]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[6]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[5]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[4]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[3]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[2]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[1]}]
set_load -pin_load 3.40189 [get_ports {address_mem_out[0]}]
set_load -pin_load 3.40189 [get_ports MemRead]
set_load -pin_load 3.40189 [get_ports MemLoad]
set_load -pin_load 3.40189 [get_ports {instruction_address[31]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[30]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[29]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[28]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[27]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[26]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[25]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[24]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[23]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[22]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[21]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[20]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[19]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[18]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[17]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[16]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[15]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[14]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[13]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[12]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[11]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[10]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[9]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[8]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[7]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[6]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[5]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[4]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[3]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[2]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[1]}]
set_load -pin_load 3.40189 [get_ports {instruction_address[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 13.28  -waveform {0 6.64}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports rst]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {start_address[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_in[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {data_mem_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {address_mem_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemRead]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MemLoad]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {instruction_address[0]}]
